{"text":"Job found by:\n \nDate posted: 2023-03-21 12:00:00\nPage 1 of 3\nJob Description\nDate Posted:\n2023-03-20\nCountry:\nUnited States of America\nLocation:\nRI101: 1847 W Main Rd 1847 W. Main Road Nimitz Building, Portsmouth, RI, 02871 USA\nPosition Role Type:\nUnspecified\nAbout Us:\nAt Raytheon Missiles & Defense (RMD), fresh thinking and possibilities are forged in times of change, and you will be on\nthe front lines as we trailblaze new approaches, push the boundaries of innovation and chart a course to a tomorrow you\ncan be proud to have a hand in creating.\nThe Software Products Engineering (SPE) organization develops software applications, including integration and test on\nmissiles, launchers, radars, naval systems, fire control and other complex systems. Our precision software and firmware\nintegrates operating systems, device drivers, networking, and control software to bring together sensor, guidance, and\nflight control processing features to complete the mission. SPE is responsible for all aspects of the software development\nlife-cycle. Our 2000+ software engineers design, develop, and build innovative solutions for our customers. Join our fast-\npaced agile teams on the leading edge of technology.\nJob Summary:\nAre you interested in joining a community of diverse, dynamic, professional engineers? Are you a Software Engineer who\nis looking for an opportunity to work in a collaborative environment which is characterized by respect for the individual\nand working in a team setting? Our company is focused on achieving excellence through thought and teamwork while\nleveraging individual diversity. Our team makes a difference in protecting our military men and women both at home and\noverseas.\nResponsibilities to Anticipate:\nRaytheon Technologies\nView Job\n \nRI101: 1847 W Main Rd 1847 W. Main Road Nimitz Building, Portsmouth, RI, 02871 USA\n \nNot Provided\nJob Title\nSoftware Engineer II C, C++, Java\nSalary\nNot Provided\nJob Type\nPermanent\nPhone Numbers\nNot Provided\nEmails\nNot ProvidedJob found by:\n \nDate posted: 2023-03-21 12:00:00\nPage 2 of 3\n* Develop robust and scalable software in C++ running Linux or UNIX operating systems on a variety of computing\nplatforms using Agile development methods.\n* Design, implement, debug and problem solve C++ Software Applications while providing feedback to other team\nmembers.\n* Help improve code quality by supporting software integration, verification, and code reviews.\n* Participate in brainstorming sessions and contribute ideas to our technology, algorithms, and products.\n* Work in a team environment with the product and design teams to understand end-user requirements, formulate use\ncases, and then translate that into a pragmatic and effective technical solution.\n* Dive into difficult problems and successfully deliver results on schedule along with other duties as assigned\nThere's no such thing as a perfect candidate, so don't hold back. Your qualifications could add tremendous value to our\nteam. Our customers come from all different backgrounds, and so do our employees. If you're passionate about what you\ncould accomplish here, we'd love to hear from you!\nQualifications You Must Have:\n* Typically requires Bachelor’s in Science, Technology, Engineering, or Mathematics and 2+ years of experience OR in\nabsence of a degree, 6 years of experience. An advanced degree in a related field may be substituted for additional years\nof experience:\n* Experience with a modern software language (such as C, C++, or Java).\n* The ability to obtain and maintain a US security clearance. U.S. citizenship is required as only U.S. citizens are eligible for\na security clearance\nQualifications We Value:\n* Experience using Unix or Linux Operating Systems\n* Existing secret clearance is highly desired\n* Broad software development experience, including unit testing, real-time, or working in a DoD environment\n* Experience in Agile development methods, including Scrum, automated testing and continuous integration\n* Strong problem-solving ability\n* Self-starter and ability to lead development, integration and test activities\n* Familiarity with the following Software Tools: Version control tools (e.g. ClearCase, GitHub), Jenkins\nWhat We Offer:\nWhether you’re just starting out on your career journey or are an experienced professional, we offer a robust total\nrewards package that goes above and beyond with compensation; healthcare, wellness, retirement and work/life\nbenefits; career development and recognition programs. Some of the superior benefits we offer include parental\n(including paternal) leave, flexible work schedules, achievement awards, educational assistance and child/adult backup\ncare.\nClearance Information: This position requires the eligibility to obtain a security clearance. Non-US citizens may not be\neligible to obtain a security clearance. The Defense Industrial Security Clearance Office (DISCO), an agency of the\nDepartment of Defense, handles and adjudicates the security clearance process. More information about SecurityJob found by:\n \nDate posted: 2023-03-21 12:00:00\nPage 3 of 3\nClearances can be found on the US Department of State government website here:\nhttps://www.state.gov/m/ds/clearances/c10978.htm\nEmployee Referral Award Eligibility: Only employees currently within RMD and RI&S have the potential to receive a\nReferral Award for submitting a referral to RMD and RI&S roles. ALL eligibility requirements must be met (see\nguidelines) to receive the Referral Awarding.\n#LI-Onsite\nRaytheon Technologies is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive\nconsideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national\norigin, disability or veteran status, age or any other federally protected class.\nPrivacy Policy and Terms:\nClick on this link to read the Policy and Terms"}
{"text":"Job found by:\n \nDate posted: 2023-03-21 12:00:00\nPage 1 of 3\nJob Description\nDate Posted:\n2023-03-20\nCountry:\nUnited States of America\nLocation:\nRI101: 1847 W Main Rd 1847 W. Main Road Nimitz Building, Portsmouth, RI, 02871 USA\nPosition Role Type:\nUnspecified\nAbout Us:\nAt Raytheon Missiles & Defense (RMD), fresh thinking and possibilities are forged in times of change, and you will be on\nthe front lines as we trailblaze new approaches, push the boundaries of innovation and chart a course to a tomorrow you\ncan be proud to have a hand in creating.\nThe Software Products Engineering (SPE) organization develops software applications, including integration and test on\nmissiles, launchers, radars, naval systems, fire control and other complex systems. Our precision software and firmware\nintegrates operating systems, device drivers, networking, and control software to bring together sensor, guidance, and\nflight control processing features to complete the mission. SPE is responsible for all aspects of the software development\nlife-cycle. Our 2000+ software engineers design, develop, and build innovative solutions for our customers. Join our fast-\npaced agile teams on the leading edge of technology.\nJob Summary:\nAre you interested in joining a community of diverse, dynamic, professional engineers? Are you a Senior Software\nEngineer who is looking for an opportunity to work in a collaborative environment which is characterized by respect for\nthe individual and working in a team setting? Our company is focused on achieving excellence through thought and\nteamwork while leveraging individual diversity. Our team makes a difference in protecting our military men and women\nboth at home and overseas.\nResponsibilities to Anticipate:\nRaytheon Technologies\nView Job\n \nRI101: 1847 W Main Rd 1847 W. Main Road Nimitz Building, Portsmouth, RI, 02871 USA\n \nNot Provided\nJob Title\nSenior Software Engineer C, C++,\nJava\nSalary\nNot Provided\nJob Type\nPermanent\nPhone Numbers\nNot Provided\nEmails\nNot ProvidedJob found by:\n \nDate posted: 2023-03-21 12:00:00\nPage 2 of 3\n* Develop robust and scalable software in C++ running Linux or UNIX operating systems on a variety of computing\nplatforms using Agile development methods.\n* Design, implement, debug and problem solve C++ Software Applications while providing feedback to other team\nmembers.\n* Help improve code quality by supporting software integration, verification, and code reviews.\n* Participate in brainstorming sessions and contribute ideas to our technology, algorithms, and products.\n* Work in a team environment with the product and design teams to understand end-user requirements, formulate use\ncases, and then translate that into a pragmatic and effective technical solution.\n* Dive into difficult problems and successfully deliver results on schedule along with other duties as assigned\nThere's no such thing as a perfect candidate, so don't hold back. Your qualifications could add tremendous value to our\nteam. Our customers come from all different backgrounds, and so do our employees. If you're passionate about what you\ncould accomplish here, we'd love to hear from you!\nQualifications You Must Have:\n* Typically requires Bachelor’s in Science, Technology, Engineering, or Mathematics and 5+ years of experience OR in\nabsence of a degree, 9 years of experience. An advanced degree in a related field may be substituted for additional years\nof experience:\n* Experience with a modern software language (such as C, C++, or Java).\n* Experience using Unix or Linux Operating Systems\n* The ability to obtain and maintain a US security clearance. U.S. citizenship is required as only U.S. citizens are eligible for\na security clearance\nQualifications We Value:\n* Existing secret clearance is highly desired\n* Broad software development experience, including unit testing, real-time, or working in a DoD environment\n* Experience in Agile development methods, including Scrum, automated testing and continuous integration\n* Strong problem-solving ability\n* Self-starter and ability to lead development, integration and test activities\n* Familiarity with the following Software Tools: Version control tools (e.g. ClearCase, GitHub), Jenkins\nWhat We Offer:\nWhether you’re just starting out on your career journey or are an experienced professional, we offer a robust total\nrewards package that goes above and beyond with compensation; healthcare, wellness, retirement and work/life\nbenefits; career development and recognition programs. Some of the superior benefits we offer include parental\n(including paternal) leave, flexible work schedules, achievement awards, educational assistance and child/adult backup\ncare.\nClearance Information: This position requires the eligibility to obtain a security clearance. Non-US citizens may not be\neligible to obtain a security clearance. The Defense Industrial Security Clearance Office (DISCO), an agency of theJob found by:\n \nDate posted: 2023-03-21 12:00:00\nPage 3 of 3\nDepartment of Defense, handles and adjudicates the security clearance process. More information about Security\nClearances can be found on the US Department of State government website here:\nhttps://www.state.gov/m/ds/clearances/c10978.htm\nEmployee Referral Award Eligibility: Only employees currently within RMD and RI&S have the potential to receive a\nReferral Award for submitting a referral to RMD and RI&S roles. ALL eligibility requirements must be met (see\nguidelines) to receive the Referral Awarding.\n#LI-Onsite\nRaytheon Technologies is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive\nconsideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national\norigin, disability or veteran status, age or any other federally protected class.\nPrivacy Policy and Terms:\nClick on this link to read the Policy and Terms"}
{"text":"Job found by:\n \nDate posted: 2023-01-31 18:15:45\nPage 1 of 3\nJob Description\nApply now »\nTitle: Student Worker Lead - UNC - Port City Java\nRequisition #: 429379\nLocation:\nChapel Hill, NC, US, 27599\nCareer Area: Food Service\nAramark\nView Job\n \nChapel Hill, NC, US, 27599\n \nNot Provided\nJob Title\nStudent Worker Lead - UNC - Port\nCity Java\nSalary\nNot Provided\nJob Type\nPermanent\nPhone Numbers\nNot Provided\nEmails\nNot ProvidedJob found by:\n \nDate posted: 2023-01-31 18:15:45\nPage 2 of 3\nDescription:\nJob Description\nThe Lead Student Worker is responsible for the supervision, training, and management of the food operation. Ensures\nthat appropriate quantities of food are prepared and served.\nJob Responsibilities\n• Produce and maintain work schedules and may prepare production records.\n• Direct daily activities.\n• Maintains food production that ensures the safety and quality of food according to policies, procedures, and\ndepartment requirements.\n• Ensure that food items are stored in a safe, organized, and hazard-free environment.\n• Maintain all serving schedules; ensure that all food items are served per menu specifications in a safe and appropriate\nmanner following department policies and procedures.\n• Maintain a sanitary department following health and safety codes and regulations.\n• Maintain accurate inventory on a weekly basis\n• May prepare orders as needed to ensure accurate production for location.\n• Supervise and evaluate employees; counsel; promote employee growth, efficiency, morale, and teamwork.\n• Maintain a safe and hazard-free working environment.\n• Train/mentor other food service workers.\n• Maintain logs on all maintenance required on equipment within the department.\n• Perform preventative maintenance checklist.\n• Recommend replacement of existing equipment to meet needs of facility.\n• Proficiency in multi-tasking.\n• Perform other duties as requested by the Food Service Director or Manager whenever his/her skill and/or experience\nwould be vital to initiate, coordinate, or complete any given program.\n• Must fill in for absent employees at location, as necessary.\n• Maintain knowledge of daily catering events and confirm they are prepared and delivered on time.\n• Attend food service meetings with staff.\n• Maintain communication with staff (including office staff, e-mail, phone calls, inter-office mail, etc).\n• May perform cashier duties as the need arises.\n• Promote good public relations.\n• Be able to work occasional night and weekend catered events.\nAt Aramark, developing new skills and doing what it takes to get the job done make a positive impact for our employees\nand for our customers. In order to meet our commitments, job duties may change or new ones may be assigned without\nformal notice.\nQualifications\n• Must read, write, and understand verbal instructions\n• Must complete a sanitation course either before or during first year\n• Ability to perform basic arithmetic\n• Maintain emotional control under stress\n• Must be knowledgeable in operating an efficient cost-effective program.\n• Ability to resolve interpersonal situations\n• Strong organizational skills\n• Must be a student at the Aramark location.Job found by:\n \nDate posted: 2023-01-31 18:15:45\nPage 3 of 3\nEducation\nAbout Aramark\nOur Mission\nRooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities,\nand our planet.\nAt Aramark, we believe that every employee should enjoy equal employment opportunity and be free to participate in all\naspects of the company. We do not discriminate on the basis of race, color, religion, national origin, age, sex, gender,\npregnancy, disability, sexual orientation, gender identity, genetic information, military status, protected veteran status or\nother characteristics protected by applicable law.\nAbout Aramark\nThe people of Aramark proudly serve millions of guests every day through food, facilities, and uniform services in 19\ncountries around the world. Rooted in service and united by our purpose, we strive to do great things for each other, our\npartners, our communities, and our planet. We believe a career should develop your talents, fuel your passions, and\nempower your professional growth. So, no matter what you're pursuing - a new challenge, a sense of belonging, or just a\ngreat place to work - our focus is helping you reach your full potential. Learn more about working here at\nhttp://www.aramarkcareers.com or connect with us on Facebook, Instagram and Twitter.\nNearest Major Market: Raleigh\nApply now »"}
{"text":"Job found by:\n \nDate posted: 2023-03-22 19:57:23\nPage 1 of 3\nJob Description\nWe have an exciting and rewarding opportunity for you to take your software engineering career to the next level.\nAs a Java Software Engineer III at JPMorgan Chase, within Consumer and Community Banking, on the Rewards team you\nserve as a seasoned member of an agile team to design and deliver trusted market-leading technology products in a\nsecure, stable, and scalable way. You are responsible for carrying out critical technology solutions across multiple\ntechnical areas within various business functions in support of the firm’s business objectives.\nJob responsibilities\nExecutes software solutions, design, development, and technical troubleshooting with ability to think beyond routine or\nconventional\napproaches to build solutions or break down technical problems\nProduces architecture and design artifacts for complex applications while being accountable for ensuring design\nconstraints are met by\nsoftware code development\nGathers, analyzes, synthesizes, and develops visualizations and reporting from large, diverse data sets in service of\ncontinuous\nYour team will discover/analyze/design/develop the best solution that aligns with the overall strategic direction and\narchitecture and leverage industry best practices and design patterns to modernize, enhance and integrate systems and\napplications\nYou’ll leverage technical expertise in Software to build integrations and technical capabilities that are innovative and\nalign to modern architecture best practices\nChase\nView Job\n \nWilmington, DE, United States\n \nNot Provided\nJob Title\nJava Software Engineer III\nSalary\nNot Provided\nJob Type\nPermanent\nPhone Numbers\nNot Provided\nEmails\nNot ProvidedJob found by:\n \nDate posted: 2023-03-22 19:57:23\nPage 2 of 3\nRequired qualifications, capabilities, and skills\nFormal training or certification on software engineering concepts and 3+ years applied experience\nHands-on practical experience in system design, application development, testing, and operational stability\nProficient in coding in one or more languages\nExperience in developing, debugging, and maintaining code in a large corporate environment with one or more modern\nprogramming\nlanguages and database querying languages\nProficient in Java/J2EE, and scalable microservices using Spring framework, Springboot\nHands-on experience in building/implementing cloud native application in a private/public Cloud environment i.e. AWS,\nAzure, Pivotal, or Google\nPreferred qualifications, capabilities, and skills\nFamiliarity with modern front-end technologies\nExposure to cloud technologies\nExcellent communication skills and able to work collaboratively across teams to deliver innovative solutions, Chase is a\nleading financial services firm, helping nearly half of America’s households and small businesses achieve their financial\ngoals through a broad range of financial products. Our mission is to create engaged, lifelong relationships and put our\ncustomers at the heart of everything we do. We also help small businesses, nonprofits and cities grow, delivering\nsolutions to solve all their financial needs.\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly\nlinked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our\ncompany. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin,\ngender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or\nany other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations\nfor applicants’ and employees’ religious practices and beliefs, as well as any mental health or physical disability needs.\nThe health and safety of our colleagues, candidates, clients and communities has been a top priority in light of the\nCOVID-19 pandemic. JPMorgan Chase was awarded the “WELL Health-Safety Rating” for all of our 6,200 locations\nglobally based on our operational policies, maintenance protocols, stakeholder engagement and emergency plans to\naddress a post-COVID-19 environment.\nAs a part of our commitment to health and safety, we have implemented various COVID-related health and safety\nrequirements for our workforce. Employees are expected to follow the Firm’s current COVID-19 or other infectious\ndisease health and safety requirements, including local requirements. Requirements include sharing information\nincluding your vaccine card in the firm’s vaccine record tool, and may include mask wearing. Requirements may change in\nthe future with the evolving public health landscape. JPMorgan Chase will consider accommodation requests as required\nby applicable law.Job found by:\n \nDate posted: 2023-03-22 19:57:23\nPage 3 of 3\nWe offer a competitive total rewards package including base salary determined based on the role, experience, skill set,\nand location. For those in eligible roles, discretionary incentive compensation which may be awarded in recognition of\nindividual achievements and contributions. We also offer a range of benefits and programs to meet employee needs,\nbased on eligibility. These benefits include comprehensive health care coverage, on-site health and wellness centers, a\nretirement savings plan, backup childcare, tuition reimbursement, mental health support, financial coaching and more.\nAdditional details about total compensation and benefits will be provided during the hiring process.\nEqual Opportunity Employer/Disability/Veterans, Our Consumer & Community Banking division serves our Chase\ncustomers through a range of financial services, including personal banking, credit cards, mortgages, auto financing,\ninvestment advice, small business loans and payment processing. We’re proud to lead the U.S. in credit card sales and\ndeposit growth and have the most-used digital solutions – all while ranking first in customer satisfaction., Java Software\nEngineer III within Consumer and Community Banking for our Rewards team in Wilmington DE, TEC, false, false, false,\nGeographyNodeId\nGeographyId\nLatitude\nLongitude\nCountryCode\n100007292113154\n300000020683471\nUS"}